#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

data.aws_iam_role.labrole: Reading...
aws_vpc.tc_vpc: Refreshing state... [id=vpc-0007de5a3b5c513a5]
aws_eip.nat_eip: Refreshing state... [id=eipalloc-037a6ab448553f286]
data.aws_iam_role.labrole: Read complete after 0s [id=LabRole]
aws_internet_gateway.tc_internet_gateway: Refreshing state... [id=igw-0d6e5029c15ba588b]
aws_subnet.public_subnet_1: Refreshing state... [id=subnet-02d73fe82246eb0f5]
aws_subnet.private_subnet_1: Refreshing state... [id=subnet-0f9b75aec58a26762]
aws_subnet.private_subnet_2: Refreshing state... [id=subnet-0c09c43199d92bca0]
aws_subnet.public_subnet_2: Refreshing state... [id=subnet-031c38d9feff86746]
aws_security_group.eks_sg: Refreshing state... [id=sg-0cfaa2580e4ad3570]
aws_route_table.public_route_table: Refreshing state... [id=rtb-02add637d23389318]
aws_nat_gateway.nat_gateway: Refreshing state... [id=nat-0bb0875219e673c46]
aws_route_table.private_route_table: Refreshing state... [id=rtb-087a0dac32282b46d]
aws_route_table_association.public_association_1: Refreshing state... [id=rtbassoc-053ae834b1d756e44]
aws_route_table_association.public_association_2: Refreshing state... [id=rtbassoc-0aecc45d110062fda]
aws_eks_cluster.tc_eks_cluster: Refreshing state... [id=eks_lanchonete-do-bairro]
aws_route_table_association.private_route_table_association_2: Refreshing state... [id=rtbassoc-026c7403c2faa1383]
aws_route_table_association.private_route_table_association_1: Refreshing state... [id=rtbassoc-037a4e91c3acf98c4]
aws_eks_access_policy_association.tc_eks_policy: Refreshing state... [id=eks_lanchonete-do-bairro#arn:aws:iam::318849967381:role/voclabs#arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy]
aws_eks_access_entry.access-entry: Refreshing state... [id=eks_lanchonete-do-bairro:arn:aws:iam::318849967381:role/voclabs]
aws_eks_node_group.tc_eks_node_group: Refreshing state... [id=eks_lanchonete-do-bairro:ng-lanchonete-do-bairro]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_apigatewayv2_api.tc_api_gateway will be created
  + resource "aws_apigatewayv2_api" "tc_api_gateway" {
      + api_endpoint                 = (known after apply)
      + api_key_selection_expression = "$request.header.x-api-key"
      + arn                          = (known after apply)
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + name                         = "tc_api_gateway"
      + protocol_type                = "HTTP"
      + route_selection_expression   = "$request.method $request.path"
      + tags_all                     = (known after apply)
    }

  # aws_apigatewayv2_integration.tc_eks_api_integration_acompanhamento will be created
  + resource "aws_apigatewayv2_integration" "tc_eks_api_integration_acompanhamento" {
      + api_id                                    = (known after apply)
      + connection_id                             = (known after apply)
      + connection_type                           = "VPC_LINK"
      + id                                        = (known after apply)
      + integration_method                        = "ANY"
      + integration_response_selection_expression = (known after apply)
      + integration_type                          = "HTTP_PROXY"
      + integration_uri                           = "arn:aws:elasticloadbalancing:us-east-1:318849967381:listener/net/a120cf2c67a6c435d858807f2e6e790b/cc95ee45f203f70c/eb0e90b1190b794e"
      + payload_format_version                    = "1.0"
      + timeout_milliseconds                      = (known after apply)
    }

  # aws_apigatewayv2_integration.tc_eks_api_integration_pagamentos will be created
  + resource "aws_apigatewayv2_integration" "tc_eks_api_integration_pagamentos" {
      + api_id                                    = (known after apply)
      + connection_id                             = (known after apply)
      + connection_type                           = "VPC_LINK"
      + id                                        = (known after apply)
      + integration_method                        = "ANY"
      + integration_response_selection_expression = (known after apply)
      + integration_type                          = "HTTP_PROXY"
      + integration_uri                           = "arn:aws:elasticloadbalancing:us-east-1:318849967381:listener/net/a1fb060dd64b640a7b28762abad5968e/b7844ead3dd5b977/c5ea5af589fd39de"
      + payload_format_version                    = "1.0"
      + timeout_milliseconds                      = (known after apply)
    }

  # aws_apigatewayv2_integration.tc_eks_api_integration_pedidos will be created
  + resource "aws_apigatewayv2_integration" "tc_eks_api_integration_pedidos" {
      + api_id                                    = (known after apply)
      + connection_id                             = (known after apply)
      + connection_type                           = "VPC_LINK"
      + id                                        = (known after apply)
      + integration_method                        = "ANY"
      + integration_response_selection_expression = (known after apply)
      + integration_type                          = "HTTP_PROXY"
      + integration_uri                           = "arn:aws:elasticloadbalancing:us-east-1:318849967381:listener/net/a2445abee09b84a91a77412b24b036c3/1ff024eff9fab2d8/3f53b427141596b5"
      + payload_format_version                    = "1.0"
      + timeout_milliseconds                      = (known after apply)
    }

  # aws_apigatewayv2_route.all_acompanhamento will be created
  + resource "aws_apigatewayv2_route" "all_acompanhamento" {
      + api_id             = (known after apply)
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + route_key          = "ANY /pedidos/{proxy+}"
      + target             = (known after apply)
    }

  # aws_apigatewayv2_route.all_pagamentos will be created
  + resource "aws_apigatewayv2_route" "all_pagamentos" {
      + api_id             = (known after apply)
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + route_key          = "ANY /pagamentos/{proxy+}"
      + target             = (known after apply)
    }

  # aws_apigatewayv2_route.all_pedidos will be created
  + resource "aws_apigatewayv2_route" "all_pedidos" {
      + api_id             = (known after apply)
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + route_key          = "ANY /acompanhamento/{proxy+}"
      + target             = (known after apply)
    }

  # aws_apigatewayv2_stage.dev will be created
  + resource "aws_apigatewayv2_stage" "dev" {
      + api_id        = (known after apply)
      + arn           = (known after apply)
      + auto_deploy   = true
      + deployment_id = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + name          = "$default"
      + tags_all      = (known after apply)
    }

  # aws_apigatewayv2_vpc_link.tc_vpc_link will be created
  + resource "aws_apigatewayv2_vpc_link" "tc_vpc_link" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "tc_vpc_link"
      + security_group_ids = (known after apply)
      + subnet_ids         = [
          + "subnet-0c09c43199d92bca0",
          + "subnet-0f9b75aec58a26762",
        ]
      + tags_all           = (known after apply)
    }

  # aws_security_group.sg_vpc_link will be created
  + resource "aws_security_group" "sg_vpc_link" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/16",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "sg_vpc_link"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = "vpc-0007de5a3b5c513a5"
    }

Plan: 10 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @BrunaPisera, Action: `pull_request`*